summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_CMU_ECLK1_NUM.
* To use register names with standard convension, please use GTM_CMU_ECLK1_NUM.
*/
#define	GTM_CMU_ECLK_1_NUM	(GTM_CMU_ECLK1_NUM)

/** \\brief  340, CMU External Clock Control Denominator Register */
#define GTM_CMU_ECLK2_DEN /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_DEN*)0xF0100340u)

/** Alias (User Manual Name) for GTM_CMU_ECLK2_DEN.
* To use register names with standard convension, please use GTM_CMU_ECLK2_DEN.
*/
#define	GTM_CMU_ECLK_2_DEN	(GTM_CMU_ECLK2_DEN)

/** \\brief  33C, CMU External Clock Control Numerator Register */
#define GTM_CMU_ECLK2_NUM /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_ECLK_NUM*)0xF010033Cu)

/** Alias (User Manual Name) for GTM_CMU_ECLK2_NUM.
* To use register names with standard convension, please use GTM_CMU_ECLK2_NUM.
*/
#define	GTM_CMU_ECLK_2_NUM	(GTM_CMU_ECLK2_NUM)

/** \\brief  344, CMU FXCLK Control Register */
#define GTM_CMU_FXCLK_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_FXCLK_CTRL*)0xF0100344u)

/** \\brief  308, CMU Global Clock Control Denominator Register */
#define GTM_CMU_GCLK_DEN /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_GCLK_DEN*)0xF0100308u)

/** \\brief  304, CMU Global Clock Control Numerator Register */
#define GTM_CMU_GCLK_NUM /*lint --e(923)*/ (*(volatile Ifx_GTM_CMU_GCLK_NUM*)0xF0100304u)

/** \\brief  8, GTM Global Control Register */
#define GTM_CTRL /*lint --e(923)*/ (*(volatile Ifx_GTM_CTRL*)0xF0100008u)

/** \\brief  28F00, DPLL Action Control i Register */
#define GTM_DPLL_ACB0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB*)0xF0128F00u)

/** \\brief  28F04, DPLL Action Control i Register */
#define GTM_DPLL_ACB1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB*)0xF0128F04u)

/** \\brief  28F08, DPLL Action Control i Register */
#define GTM_DPLL_ACB2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB*)0xF0128F08u)

/** \\brief  28F0C, DPLL Action Control i Register */
#define GTM_DPLL_ACB3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB*)0xF0128F0Cu)

/** \\brief  28F10, DPLL Action Control i Register */
#define GTM_DPLL_ACB4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB*)0xF0128F10u)

/** \\brief  28F14, DPLL Action Control i Register */
#define GTM_DPLL_ACB5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACB*)0xF0128F14u)

/** \\brief  28018, DPLL ACTION Status Register With Shadow Register */
#define GTM_DPLL_ACT_STA /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ACT_STA*)0xF0128018u)

/** \\brief  28438, Calculated ADD_IN Value for SUB_INC1 Generation */
#define GTM_DPLL_ADD_IN_CAL1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_CAL1*)0xF0128438u)

/** Alias (User Manual Name) for GTM_DPLL_ADD_IN_CAL1.
* To use register names with standard convension, please use GTM_DPLL_ADD_IN_CAL1.
*/
#define	GTM_ADD_IN_CAL1	(GTM_DPLL_ADD_IN_CAL1)

/** \\brief  2843C, Calculated ADD_IN Value for SUB_INC2 Generation */
#define GTM_DPLL_ADD_IN_CAL2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_CAL2*)0xF012843Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADD_IN_CAL2.
* To use register names with standard convension, please use GTM_DPLL_ADD_IN_CAL2.
*/
#define	GTM_ADD_IN_CAL2	(GTM_DPLL_ADD_IN_CAL2)

/** \\brief  280C8, DPLL Direct Load Input Value for SUB_INC1 */
#define GTM_DPLL_ADD_IN_LD1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_LD1*)0xF01280C8u)

/** Alias (User Manual Name) for GTM_DPLL_ADD_IN_LD1.
* To use register names with standard convension, please use GTM_DPLL_ADD_IN_LD1.
*/
#define	GTM_ADD_IN_LD1	(GTM_DPLL_ADD_IN_LD1)

/** \\brief  280CC, DPLL Direct Load Input Value for SUB_INC1 */
#define GTM_DPLL_ADD_IN_LD2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADD_IN_LD2*)0xF01280CCu)

/** Alias (User Manual Name) for GTM_DPLL_ADD_IN_LD2.
* To use register names with standard convension, please use GTM_DPLL_ADD_IN_LD2.
*/
#define	GTM_ADD_IN_LD2	(GTM_DPLL_ADD_IN_LD2)

/** \\brief  28800, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128800u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S0.
* To use register names with standard convension, please use GTM_DPLL_ADT_S0.
*/
#define	GTM_ADT_S0	(GTM_DPLL_ADT_S0)

/** \\brief  28804, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128804u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S1.
* To use register names with standard convension, please use GTM_DPLL_ADT_S1.
*/
#define	GTM_ADT_S1	(GTM_DPLL_ADT_S1)

/** \\brief  28828, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128828u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S10.
* To use register names with standard convension, please use GTM_DPLL_ADT_S10.
*/
#define	GTM_ADT_S10	(GTM_DPLL_ADT_S10)

/** \\brief  2882C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012882Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S11.
* To use register names with standard convension, please use GTM_DPLL_ADT_S11.
*/
#define	GTM_ADT_S11	(GTM_DPLL_ADT_S11)

/** \\brief  28830, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128830u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S12.
* To use register names with standard convension, please use GTM_DPLL_ADT_S12.
*/
#define	GTM_ADT_S12	(GTM_DPLL_ADT_S12)

/** \\brief  28834, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128834u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S13.
* To use register names with standard convension, please use GTM_DPLL_ADT_S13.
*/
#define	GTM_ADT_S13	(GTM_DPLL_ADT_S13)

/** \\brief  28838, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128838u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S14.
* To use register names with standard convension, please use GTM_DPLL_ADT_S14.
*/
#define	GTM_ADT_S14	(GTM_DPLL_ADT_S14)

/** \\brief  2883C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012883Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S15.
* To use register names with standard convension, please use GTM_DPLL_ADT_S15.
*/
#define	GTM_ADT_S15	(GTM_DPLL_ADT_S15)

/** \\brief  28840, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128840u)

