summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_ADT_S16.
* To use register names with standard convension, please use GTM_DPLL_ADT_S16.
*/
#define	GTM_ADT_S16	(GTM_DPLL_ADT_S16)

/** \\brief  28844, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128844u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S17.
* To use register names with standard convension, please use GTM_DPLL_ADT_S17.
*/
#define	GTM_ADT_S17	(GTM_DPLL_ADT_S17)

/** \\brief  28848, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128848u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S18.
* To use register names with standard convension, please use GTM_DPLL_ADT_S18.
*/
#define	GTM_ADT_S18	(GTM_DPLL_ADT_S18)

/** \\brief  2884C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012884Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S19.
* To use register names with standard convension, please use GTM_DPLL_ADT_S19.
*/
#define	GTM_ADT_S19	(GTM_DPLL_ADT_S19)

/** \\brief  28808, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128808u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S2.
* To use register names with standard convension, please use GTM_DPLL_ADT_S2.
*/
#define	GTM_ADT_S2	(GTM_DPLL_ADT_S2)

/** \\brief  28850, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128850u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S20.
* To use register names with standard convension, please use GTM_DPLL_ADT_S20.
*/
#define	GTM_ADT_S20	(GTM_DPLL_ADT_S20)

/** \\brief  28854, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128854u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S21.
* To use register names with standard convension, please use GTM_DPLL_ADT_S21.
*/
#define	GTM_ADT_S21	(GTM_DPLL_ADT_S21)

/** \\brief  28858, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128858u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S22.
* To use register names with standard convension, please use GTM_DPLL_ADT_S22.
*/
#define	GTM_ADT_S22	(GTM_DPLL_ADT_S22)

/** \\brief  2885C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012885Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S23.
* To use register names with standard convension, please use GTM_DPLL_ADT_S23.
*/
#define	GTM_ADT_S23	(GTM_DPLL_ADT_S23)

/** \\brief  28860, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128860u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S24.
* To use register names with standard convension, please use GTM_DPLL_ADT_S24.
*/
#define	GTM_ADT_S24	(GTM_DPLL_ADT_S24)

/** \\brief  28864, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128864u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S25.
* To use register names with standard convension, please use GTM_DPLL_ADT_S25.
*/
#define	GTM_ADT_S25	(GTM_DPLL_ADT_S25)

/** \\brief  28868, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128868u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S26.
* To use register names with standard convension, please use GTM_DPLL_ADT_S26.
*/
#define	GTM_ADT_S26	(GTM_DPLL_ADT_S26)

/** \\brief  2886C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012886Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S27.
* To use register names with standard convension, please use GTM_DPLL_ADT_S27.
*/
#define	GTM_ADT_S27	(GTM_DPLL_ADT_S27)

/** \\brief  28870, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128870u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S28.
* To use register names with standard convension, please use GTM_DPLL_ADT_S28.
*/
#define	GTM_ADT_S28	(GTM_DPLL_ADT_S28)

/** \\brief  28874, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128874u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S29.
* To use register names with standard convension, please use GTM_DPLL_ADT_S29.
*/
#define	GTM_ADT_S29	(GTM_DPLL_ADT_S29)

/** \\brief  2880C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012880Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S3.
* To use register names with standard convension, please use GTM_DPLL_ADT_S3.
*/
#define	GTM_ADT_S3	(GTM_DPLL_ADT_S3)

/** \\brief  28878, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128878u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S30.
* To use register names with standard convension, please use GTM_DPLL_ADT_S30.
*/
#define	GTM_ADT_S30	(GTM_DPLL_ADT_S30)

/** \\brief  2887C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012887Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S31.
* To use register names with standard convension, please use GTM_DPLL_ADT_S31.
*/
#define	GTM_ADT_S31	(GTM_DPLL_ADT_S31)

/** \\brief  28880, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S32 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128880u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S32.
* To use register names with standard convension, please use GTM_DPLL_ADT_S32.
*/
#define	GTM_ADT_S32	(GTM_DPLL_ADT_S32)

/** \\brief  28884, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S33 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128884u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S33.
* To use register names with standard convension, please use GTM_DPLL_ADT_S33.
*/
#define	GTM_ADT_S33	(GTM_DPLL_ADT_S33)

