summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** \\brief  28888, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S34 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128888u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S34.
* To use register names with standard convension, please use GTM_DPLL_ADT_S34.
*/
#define	GTM_ADT_S34	(GTM_DPLL_ADT_S34)

/** \\brief  2888C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S35 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012888Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S35.
* To use register names with standard convension, please use GTM_DPLL_ADT_S35.
*/
#define	GTM_ADT_S35	(GTM_DPLL_ADT_S35)

/** \\brief  28890, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S36 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128890u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S36.
* To use register names with standard convension, please use GTM_DPLL_ADT_S36.
*/
#define	GTM_ADT_S36	(GTM_DPLL_ADT_S36)

/** \\brief  28894, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S37 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128894u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S37.
* To use register names with standard convension, please use GTM_DPLL_ADT_S37.
*/
#define	GTM_ADT_S37	(GTM_DPLL_ADT_S37)

/** \\brief  28898, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S38 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128898u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S38.
* To use register names with standard convension, please use GTM_DPLL_ADT_S38.
*/
#define	GTM_ADT_S38	(GTM_DPLL_ADT_S38)

/** \\brief  2889C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S39 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012889Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S39.
* To use register names with standard convension, please use GTM_DPLL_ADT_S39.
*/
#define	GTM_ADT_S39	(GTM_DPLL_ADT_S39)

/** \\brief  28810, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128810u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S4.
* To use register names with standard convension, please use GTM_DPLL_ADT_S4.
*/
#define	GTM_ADT_S4	(GTM_DPLL_ADT_S4)

/** \\brief  288A0, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S40 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288A0u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S40.
* To use register names with standard convension, please use GTM_DPLL_ADT_S40.
*/
#define	GTM_ADT_S40	(GTM_DPLL_ADT_S40)

/** \\brief  288A4, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S41 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288A4u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S41.
* To use register names with standard convension, please use GTM_DPLL_ADT_S41.
*/
#define	GTM_ADT_S41	(GTM_DPLL_ADT_S41)

/** \\brief  288A8, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S42 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288A8u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S42.
* To use register names with standard convension, please use GTM_DPLL_ADT_S42.
*/
#define	GTM_ADT_S42	(GTM_DPLL_ADT_S42)

/** \\brief  288AC, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S43 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288ACu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S43.
* To use register names with standard convension, please use GTM_DPLL_ADT_S43.
*/
#define	GTM_ADT_S43	(GTM_DPLL_ADT_S43)

/** \\brief  288B0, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S44 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288B0u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S44.
* To use register names with standard convension, please use GTM_DPLL_ADT_S44.
*/
#define	GTM_ADT_S44	(GTM_DPLL_ADT_S44)

/** \\brief  288B4, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S45 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288B4u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S45.
* To use register names with standard convension, please use GTM_DPLL_ADT_S45.
*/
#define	GTM_ADT_S45	(GTM_DPLL_ADT_S45)

/** \\brief  288B8, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S46 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288B8u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S46.
* To use register names with standard convension, please use GTM_DPLL_ADT_S46.
*/
#define	GTM_ADT_S46	(GTM_DPLL_ADT_S46)

/** \\brief  288BC, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S47 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288BCu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S47.
* To use register names with standard convension, please use GTM_DPLL_ADT_S47.
*/
#define	GTM_ADT_S47	(GTM_DPLL_ADT_S47)

/** \\brief  288C0, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S48 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288C0u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S48.
* To use register names with standard convension, please use GTM_DPLL_ADT_S48.
*/
#define	GTM_ADT_S48	(GTM_DPLL_ADT_S48)

/** \\brief  288C4, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S49 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288C4u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S49.
* To use register names with standard convension, please use GTM_DPLL_ADT_S49.
*/
#define	GTM_ADT_S49	(GTM_DPLL_ADT_S49)

/** \\brief  28814, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128814u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S5.
* To use register names with standard convension, please use GTM_DPLL_ADT_S5.
*/
#define	GTM_ADT_S5	(GTM_DPLL_ADT_S5)

/** \\brief  288C8, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S50 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288C8u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S50.
* To use register names with standard convension, please use GTM_DPLL_ADT_S50.
*/
#define	GTM_ADT_S50	(GTM_DPLL_ADT_S50)

/** \\brief  288CC, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S51 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288CCu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S51.
* To use register names with standard convension, please use GTM_DPLL_ADT_S51.
*/
#define	GTM_ADT_S51	(GTM_DPLL_ADT_S51)

