summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** \\brief  288D0, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S52 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288D0u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S52.
* To use register names with standard convension, please use GTM_DPLL_ADT_S52.
*/
#define	GTM_ADT_S52	(GTM_DPLL_ADT_S52)

/** \\brief  288D4, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S53 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288D4u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S53.
* To use register names with standard convension, please use GTM_DPLL_ADT_S53.
*/
#define	GTM_ADT_S53	(GTM_DPLL_ADT_S53)

/** \\brief  288D8, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S54 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288D8u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S54.
* To use register names with standard convension, please use GTM_DPLL_ADT_S54.
*/
#define	GTM_ADT_S54	(GTM_DPLL_ADT_S54)

/** \\brief  288DC, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S55 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288DCu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S55.
* To use register names with standard convension, please use GTM_DPLL_ADT_S55.
*/
#define	GTM_ADT_S55	(GTM_DPLL_ADT_S55)

/** \\brief  288E0, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S56 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288E0u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S56.
* To use register names with standard convension, please use GTM_DPLL_ADT_S56.
*/
#define	GTM_ADT_S56	(GTM_DPLL_ADT_S56)

/** \\brief  288E4, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S57 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288E4u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S57.
* To use register names with standard convension, please use GTM_DPLL_ADT_S57.
*/
#define	GTM_ADT_S57	(GTM_DPLL_ADT_S57)

/** \\brief  288E8, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S58 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288E8u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S58.
* To use register names with standard convension, please use GTM_DPLL_ADT_S58.
*/
#define	GTM_ADT_S58	(GTM_DPLL_ADT_S58)

/** \\brief  288EC, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S59 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288ECu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S59.
* To use register names with standard convension, please use GTM_DPLL_ADT_S59.
*/
#define	GTM_ADT_S59	(GTM_DPLL_ADT_S59)

/** \\brief  28818, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128818u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S6.
* To use register names with standard convension, please use GTM_DPLL_ADT_S6.
*/
#define	GTM_ADT_S6	(GTM_DPLL_ADT_S6)

/** \\brief  288F0, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S60 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288F0u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S60.
* To use register names with standard convension, please use GTM_DPLL_ADT_S60.
*/
#define	GTM_ADT_S60	(GTM_DPLL_ADT_S60)

/** \\brief  288F4, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S61 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288F4u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S61.
* To use register names with standard convension, please use GTM_DPLL_ADT_S61.
*/
#define	GTM_ADT_S61	(GTM_DPLL_ADT_S61)

/** \\brief  288F8, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S62 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288F8u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S62.
* To use register names with standard convension, please use GTM_DPLL_ADT_S62.
*/
#define	GTM_ADT_S62	(GTM_DPLL_ADT_S62)

/** \\brief  288FC, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S63 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF01288FCu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S63.
* To use register names with standard convension, please use GTM_DPLL_ADT_S63.
*/
#define	GTM_ADT_S63	(GTM_DPLL_ADT_S63)

/** \\brief  2881C, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF012881Cu)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S7.
* To use register names with standard convension, please use GTM_DPLL_ADT_S7.
*/
#define	GTM_ADT_S7	(GTM_DPLL_ADT_S7)

/** \\brief  28820, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128820u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S8.
* To use register names with standard convension, please use GTM_DPLL_ADT_S8.
*/
#define	GTM_ADT_S8	(GTM_DPLL_ADT_S8)

/** \\brief  28824, Adapt Values for All STATE Increments */
#define GTM_DPLL_ADT_S9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_ADT_S*)0xF0128824u)

/** Alias (User Manual Name) for GTM_DPLL_ADT_S9.
* To use register names with standard convension, please use GTM_DPLL_ADT_S9.
*/
#define	GTM_ADT_S9	(GTM_DPLL_ADT_S9)

/** \\brief  28020, DPLL Address Offset Register For APT In RAM Region 2 */
#define GTM_DPLL_AOSV_2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_AOSV_2*)0xF0128020u)

/** \\brief  28028, DPLL Actual RAM Pointer to RAM Regions 1c1, 1c2 and 1c4 */
#define GTM_DPLL_APS /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APS*)0xF0128028u)

/** \\brief  28030, DPLL Actual RAM Pointer to RAM Region 1C3 */
#define GTM_DPLL_APS_1C3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APS_1C3*)0xF0128030u)

/** \\brief  280BC, DPLL Old RAM Pointer and Offset Value for STATE */
#define GTM_DPLL_APS_SYNC /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APS_SYNC*)0xF01280BCu)

/** \\brief  28024, DPLL Actual RAM Pointer to RAM Regions 2a, b and d */
#define GTM_DPLL_APT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APT*)0xF0128024u)

/** \\brief  2802C, DPLL Actual RAM Pointer to RAM Region 2C */
#define GTM_DPLL_APT_2C /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APT_2C*)0xF012802Cu)

/** \\brief  280B8, DPLL Old RAM Pointer and Offset Value for TRIGGER */
#define GTM_DPLL_APT_SYNC /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_APT_SYNC*)0xF01280B8u)

/** \\brief  28494, Prediction of the actual STATE Increment */
#define GTM_DPLL_CDT_SX /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CDT_SX*)0xF0128494u)

/** Alias (User Manual Name) for GTM_DPLL_CDT_SX.
* To use register names with standard convension, please use GTM_DPLL_CDT_SX.
*/
#define	GTM_CDT_SX	(GTM_DPLL_CDT_SX)

/** \\brief  2849C, Prediction of the nominal STATE increment duration */
#define GTM_DPLL_CDT_SX_NOM /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CDT_SX_NOM*)0xF012849Cu)

/** Alias (User Manual Name) for GTM_DPLL_CDT_SX_NOM.
* To use register names with standard convension, please use GTM_DPLL_CDT_SX_NOM.
*/
#define	GTM_CDT_SX_NOM	(GTM_DPLL_CDT_SX_NOM)

/** \\brief  28490, Prediction of the actual TRIGGER Increment */
#define GTM_DPLL_CDT_TX /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CDT_TX*)0xF0128490u)

/** Alias (User Manual Name) for GTM_DPLL_CDT_TX.
* To use register names with standard convension, please use GTM_DPLL_CDT_TX.
*/
#define	GTM_CDT_TX	(GTM_DPLL_CDT_TX)

/** \\brief  28498, Prediction of the nominal TRIGGER Increment duration */
#define GTM_DPLL_CDT_TX_NOM /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CDT_TX_NOM*)0xF0128498u)

/** Alias (User Manual Name) for GTM_DPLL_CDT_TX_NOM.
* To use register names with standard convension, please use GTM_DPLL_CDT_TX_NOM.
*/
#define	GTM_CDT_TX_NOM	(GTM_DPLL_CDT_TX_NOM)

/** \\brief  285C8, Number of Sub-Pulses of SUB_INC1 in Continuous Mode */
#define GTM_DPLL_CNT_NUM1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CNT_NUM1*)0xF01285C8u)

