summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_CNT_NUM1.
* To use register names with standard convension, please use GTM_DPLL_CNT_NUM1.
*/
#define	GTM_CNT_NUM1	(GTM_DPLL_CNT_NUM1)

/** \\brief  285CC, Number of Sub-Pulses of SUB_INC2 in Continuous Mode */
#define GTM_DPLL_CNT_NUM2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CNT_NUM2*)0xF01285CCu)

/** Alias (User Manual Name) for GTM_DPLL_CNT_NUM2.
* To use register names with standard convension, please use GTM_DPLL_CNT_NUM2.
*/
#define	GTM_CNT_NUM2	(GTM_DPLL_CNT_NUM2)

/** \\brief  281EC, DPLL Control 1 Shadow STATE Register */
#define GTM_DPLL_CRTL_1_SHADOW_STATE /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CRTL_1_SHADOW_STATE*)0xF01281ECu)

/** \\brief  28000, DPLL Control Register 0 */
#define GTM_DPLL_CTRL_0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_0*)0xF0128000u)

/** \\brief  281E4, DPLL Control 0 Shadow STATE Register */
#define GTM_DPLL_CTRL_0_SHADOW_STATE /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_0_SHADOW_STATE*)0xF01281E4u)

/** \\brief  281E0, DPLL Control0 Shadow Trigger Register */
#define GTM_DPLL_CTRL_0_SHADOW_TRIGGER /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_0_SHADOW_TRIGGER*)0xF01281E0u)

/** \\brief  28004, DPLL Control Register 1 */
#define GTM_DPLL_CTRL_1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_1*)0xF0128004u)

/** \\brief  281E8, DPLL Control 1 Shadow TRIGGER Register */
#define GTM_DPLL_CTRL_1_SHADOW_TRIGGER /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_1_SHADOW_TRIGGER*)0xF01281E8u)

/** \\brief  28008, DPLL Control Register 2 */
#define GTM_DPLL_CTRL_2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_2*)0xF0128008u)

/** \\brief  2800C, DPLL Control Register 3 */
#define GTM_DPLL_CTRL_3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_3*)0xF012800Cu)

/** \\brief  28010, DPLL Control Register 4 */
#define GTM_DPLL_CTRL_4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_CTRL_4*)0xF0128010u)

/** \\brief  28280, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF0128280u)

/** Alias (User Manual Name) for GTM_DPLL_DLA0.
* To use register names with standard convension, please use GTM_DPLL_DLA0.
*/
#define	GTM_DLA0	(GTM_DPLL_DLA0)

/** \\brief  28284, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF0128284u)

/** Alias (User Manual Name) for GTM_DPLL_DLA1.
* To use register names with standard convension, please use GTM_DPLL_DLA1.
*/
#define	GTM_DLA1	(GTM_DPLL_DLA1)

/** \\brief  282A8, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282A8u)

/** Alias (User Manual Name) for GTM_DPLL_DLA10.
* To use register names with standard convension, please use GTM_DPLL_DLA10.
*/
#define	GTM_DLA10	(GTM_DPLL_DLA10)

/** \\brief  282AC, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282ACu)

/** Alias (User Manual Name) for GTM_DPLL_DLA11.
* To use register names with standard convension, please use GTM_DPLL_DLA11.
*/
#define	GTM_DLA11	(GTM_DPLL_DLA11)

/** \\brief  282B0, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282B0u)

/** Alias (User Manual Name) for GTM_DPLL_DLA12.
* To use register names with standard convension, please use GTM_DPLL_DLA12.
*/
#define	GTM_DLA12	(GTM_DPLL_DLA12)

/** \\brief  282B4, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282B4u)

/** Alias (User Manual Name) for GTM_DPLL_DLA13.
* To use register names with standard convension, please use GTM_DPLL_DLA13.
*/
#define	GTM_DLA13	(GTM_DPLL_DLA13)

/** \\brief  282B8, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282B8u)

/** Alias (User Manual Name) for GTM_DPLL_DLA14.
* To use register names with standard convension, please use GTM_DPLL_DLA14.
*/
#define	GTM_DLA14	(GTM_DPLL_DLA14)

/** \\brief  282BC, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282BCu)

/** Alias (User Manual Name) for GTM_DPLL_DLA15.
* To use register names with standard convension, please use GTM_DPLL_DLA15.
*/
#define	GTM_DLA15	(GTM_DPLL_DLA15)

/** \\brief  282C0, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282C0u)

/** Alias (User Manual Name) for GTM_DPLL_DLA16.
* To use register names with standard convension, please use GTM_DPLL_DLA16.
*/
#define	GTM_DLA16	(GTM_DPLL_DLA16)

/** \\brief  282C4, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282C4u)

/** Alias (User Manual Name) for GTM_DPLL_DLA17.
* To use register names with standard convension, please use GTM_DPLL_DLA17.
*/
#define	GTM_DLA17	(GTM_DPLL_DLA17)

/** \\brief  282C8, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282C8u)

/** Alias (User Manual Name) for GTM_DPLL_DLA18.
* To use register names with standard convension, please use GTM_DPLL_DLA18.
*/
#define	GTM_DLA18	(GTM_DPLL_DLA18)

/** \\brief  282CC, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282CCu)

/** Alias (User Manual Name) for GTM_DPLL_DLA19.
* To use register names with standard convension, please use GTM_DPLL_DLA19.
*/
#define	GTM_DLA19	(GTM_DPLL_DLA19)

/** \\brief  28288, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF0128288u)

/** Alias (User Manual Name) for GTM_DPLL_DLA2.
* To use register names with standard convension, please use GTM_DPLL_DLA2.
*/
#define	GTM_DLA2	(GTM_DPLL_DLA2)

/** \\brief  282D0, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282D0u)

/** Alias (User Manual Name) for GTM_DPLL_DLA20.
* To use register names with standard convension, please use GTM_DPLL_DLA20.
*/
#define	GTM_DLA20	(GTM_DPLL_DLA20)

