summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** \\brief  282D4, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282D4u)

/** Alias (User Manual Name) for GTM_DPLL_DLA21.
* To use register names with standard convension, please use GTM_DPLL_DLA21.
*/
#define	GTM_DLA21	(GTM_DPLL_DLA21)

/** \\brief  282D8, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282D8u)

/** Alias (User Manual Name) for GTM_DPLL_DLA22.
* To use register names with standard convension, please use GTM_DPLL_DLA22.
*/
#define	GTM_DLA22	(GTM_DPLL_DLA22)

/** \\brief  282DC, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282DCu)

/** Alias (User Manual Name) for GTM_DPLL_DLA23.
* To use register names with standard convension, please use GTM_DPLL_DLA23.
*/
#define	GTM_DLA23	(GTM_DPLL_DLA23)

/** \\brief  2828C, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF012828Cu)

/** Alias (User Manual Name) for GTM_DPLL_DLA3.
* To use register names with standard convension, please use GTM_DPLL_DLA3.
*/
#define	GTM_DLA3	(GTM_DPLL_DLA3)

/** \\brief  28290, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF0128290u)

/** Alias (User Manual Name) for GTM_DPLL_DLA4.
* To use register names with standard convension, please use GTM_DPLL_DLA4.
*/
#define	GTM_DLA4	(GTM_DPLL_DLA4)

/** \\brief  28294, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF0128294u)

/** Alias (User Manual Name) for GTM_DPLL_DLA5.
* To use register names with standard convension, please use GTM_DPLL_DLA5.
*/
#define	GTM_DLA5	(GTM_DPLL_DLA5)

/** \\brief  28298, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF0128298u)

/** Alias (User Manual Name) for GTM_DPLL_DLA6.
* To use register names with standard convension, please use GTM_DPLL_DLA6.
*/
#define	GTM_DLA6	(GTM_DPLL_DLA6)

/** \\brief  2829C, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF012829Cu)

/** Alias (User Manual Name) for GTM_DPLL_DLA7.
* To use register names with standard convension, please use GTM_DPLL_DLA7.
*/
#define	GTM_DLA7	(GTM_DPLL_DLA7)

/** \\brief  282A0, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282A0u)

/** Alias (User Manual Name) for GTM_DPLL_DLA8.
* To use register names with standard convension, please use GTM_DPLL_DLA8.
*/
#define	GTM_DLA8	(GTM_DPLL_DLA8)

/** \\brief  282A4, ACTION Time To React Before PSAi Register */
#define GTM_DPLL_DLA9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DLA*)0xF01282A4u)

/** Alias (User Manual Name) for GTM_DPLL_DLA9.
* To use register names with standard convension, please use GTM_DPLL_DLA9.
*/
#define	GTM_DLA9	(GTM_DPLL_DLA9)

/** \\brief  28900, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128900u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S0.
* To use register names with standard convension, please use GTM_DPLL_DT_S0.
*/
#define	GTM_DT_S0	(GTM_DPLL_DT_S0)

/** \\brief  28904, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128904u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S1.
* To use register names with standard convension, please use GTM_DPLL_DT_S1.
*/
#define	GTM_DT_S1	(GTM_DPLL_DT_S1)

/** \\brief  28928, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128928u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S10.
* To use register names with standard convension, please use GTM_DPLL_DT_S10.
*/
#define	GTM_DT_S10	(GTM_DPLL_DT_S10)

/** \\brief  2892C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012892Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S11.
* To use register names with standard convension, please use GTM_DPLL_DT_S11.
*/
#define	GTM_DT_S11	(GTM_DPLL_DT_S11)

/** \\brief  28930, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128930u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S12.
* To use register names with standard convension, please use GTM_DPLL_DT_S12.
*/
#define	GTM_DT_S12	(GTM_DPLL_DT_S12)

/** \\brief  28934, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128934u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S13.
* To use register names with standard convension, please use GTM_DPLL_DT_S13.
*/
#define	GTM_DT_S13	(GTM_DPLL_DT_S13)

/** \\brief  28938, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128938u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S14.
* To use register names with standard convension, please use GTM_DPLL_DT_S14.
*/
#define	GTM_DT_S14	(GTM_DPLL_DT_S14)

/** \\brief  2893C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012893Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S15.
* To use register names with standard convension, please use GTM_DPLL_DT_S15.
*/
#define	GTM_DT_S15	(GTM_DPLL_DT_S15)

/** \\brief  28940, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128940u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S16.
* To use register names with standard convension, please use GTM_DPLL_DT_S16.
*/
#define	GTM_DT_S16	(GTM_DPLL_DT_S16)

