summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** \\brief  28944, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128944u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S17.
* To use register names with standard convension, please use GTM_DPLL_DT_S17.
*/
#define	GTM_DT_S17	(GTM_DPLL_DT_S17)

/** \\brief  28948, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128948u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S18.
* To use register names with standard convension, please use GTM_DPLL_DT_S18.
*/
#define	GTM_DT_S18	(GTM_DPLL_DT_S18)

/** \\brief  2894C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012894Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S19.
* To use register names with standard convension, please use GTM_DPLL_DT_S19.
*/
#define	GTM_DT_S19	(GTM_DPLL_DT_S19)

/** \\brief  28908, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128908u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S2.
* To use register names with standard convension, please use GTM_DPLL_DT_S2.
*/
#define	GTM_DT_S2	(GTM_DPLL_DT_S2)

/** \\brief  28950, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128950u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S20.
* To use register names with standard convension, please use GTM_DPLL_DT_S20.
*/
#define	GTM_DT_S20	(GTM_DPLL_DT_S20)

/** \\brief  28954, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128954u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S21.
* To use register names with standard convension, please use GTM_DPLL_DT_S21.
*/
#define	GTM_DT_S21	(GTM_DPLL_DT_S21)

/** \\brief  28958, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128958u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S22.
* To use register names with standard convension, please use GTM_DPLL_DT_S22.
*/
#define	GTM_DT_S22	(GTM_DPLL_DT_S22)

/** \\brief  2895C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012895Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S23.
* To use register names with standard convension, please use GTM_DPLL_DT_S23.
*/
#define	GTM_DT_S23	(GTM_DPLL_DT_S23)

/** \\brief  28960, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128960u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S24.
* To use register names with standard convension, please use GTM_DPLL_DT_S24.
*/
#define	GTM_DT_S24	(GTM_DPLL_DT_S24)

/** \\brief  28964, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128964u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S25.
* To use register names with standard convension, please use GTM_DPLL_DT_S25.
*/
#define	GTM_DT_S25	(GTM_DPLL_DT_S25)

/** \\brief  28968, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128968u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S26.
* To use register names with standard convension, please use GTM_DPLL_DT_S26.
*/
#define	GTM_DT_S26	(GTM_DPLL_DT_S26)

/** \\brief  2896C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012896Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S27.
* To use register names with standard convension, please use GTM_DPLL_DT_S27.
*/
#define	GTM_DT_S27	(GTM_DPLL_DT_S27)

/** \\brief  28970, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128970u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S28.
* To use register names with standard convension, please use GTM_DPLL_DT_S28.
*/
#define	GTM_DT_S28	(GTM_DPLL_DT_S28)

/** \\brief  28974, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128974u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S29.
* To use register names with standard convension, please use GTM_DPLL_DT_S29.
*/
#define	GTM_DT_S29	(GTM_DPLL_DT_S29)

/** \\brief  2890C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012890Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S3.
* To use register names with standard convension, please use GTM_DPLL_DT_S3.
*/
#define	GTM_DT_S3	(GTM_DPLL_DT_S3)

/** \\brief  28978, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128978u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S30.
* To use register names with standard convension, please use GTM_DPLL_DT_S30.
*/
#define	GTM_DT_S30	(GTM_DPLL_DT_S30)

/** \\brief  2897C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012897Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S31.
* To use register names with standard convension, please use GTM_DPLL_DT_S31.
*/
#define	GTM_DT_S31	(GTM_DPLL_DT_S31)

/** \\brief  28980, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S32 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128980u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S32.
* To use register names with standard convension, please use GTM_DPLL_DT_S32.
*/
#define	GTM_DT_S32	(GTM_DPLL_DT_S32)

/** \\brief  28984, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S33 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128984u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S33.
* To use register names with standard convension, please use GTM_DPLL_DT_S33.
*/
#define	GTM_DT_S33	(GTM_DPLL_DT_S33)

