summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** \\brief  28988, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S34 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128988u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S34.
* To use register names with standard convension, please use GTM_DPLL_DT_S34.
*/
#define	GTM_DT_S34	(GTM_DPLL_DT_S34)

/** \\brief  2898C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S35 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012898Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S35.
* To use register names with standard convension, please use GTM_DPLL_DT_S35.
*/
#define	GTM_DT_S35	(GTM_DPLL_DT_S35)

/** \\brief  28990, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S36 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128990u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S36.
* To use register names with standard convension, please use GTM_DPLL_DT_S36.
*/
#define	GTM_DT_S36	(GTM_DPLL_DT_S36)

/** \\brief  28994, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S37 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128994u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S37.
* To use register names with standard convension, please use GTM_DPLL_DT_S37.
*/
#define	GTM_DT_S37	(GTM_DPLL_DT_S37)

/** \\brief  28998, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S38 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128998u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S38.
* To use register names with standard convension, please use GTM_DPLL_DT_S38.
*/
#define	GTM_DT_S38	(GTM_DPLL_DT_S38)

/** \\brief  2899C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S39 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012899Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S39.
* To use register names with standard convension, please use GTM_DPLL_DT_S39.
*/
#define	GTM_DT_S39	(GTM_DPLL_DT_S39)

/** \\brief  28910, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128910u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S4.
* To use register names with standard convension, please use GTM_DPLL_DT_S4.
*/
#define	GTM_DT_S4	(GTM_DPLL_DT_S4)

/** \\brief  289A0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S40 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289A0u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S40.
* To use register names with standard convension, please use GTM_DPLL_DT_S40.
*/
#define	GTM_DT_S40	(GTM_DPLL_DT_S40)

/** \\brief  289A4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S41 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289A4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S41.
* To use register names with standard convension, please use GTM_DPLL_DT_S41.
*/
#define	GTM_DT_S41	(GTM_DPLL_DT_S41)

/** \\brief  289A8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S42 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289A8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S42.
* To use register names with standard convension, please use GTM_DPLL_DT_S42.
*/
#define	GTM_DT_S42	(GTM_DPLL_DT_S42)

/** \\brief  289AC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S43 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289ACu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S43.
* To use register names with standard convension, please use GTM_DPLL_DT_S43.
*/
#define	GTM_DT_S43	(GTM_DPLL_DT_S43)

/** \\brief  289B0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S44 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289B0u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S44.
* To use register names with standard convension, please use GTM_DPLL_DT_S44.
*/
#define	GTM_DT_S44	(GTM_DPLL_DT_S44)

/** \\brief  289B4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S45 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289B4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S45.
* To use register names with standard convension, please use GTM_DPLL_DT_S45.
*/
#define	GTM_DT_S45	(GTM_DPLL_DT_S45)

/** \\brief  289B8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S46 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289B8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S46.
* To use register names with standard convension, please use GTM_DPLL_DT_S46.
*/
#define	GTM_DT_S46	(GTM_DPLL_DT_S46)

/** \\brief  289BC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S47 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289BCu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S47.
* To use register names with standard convension, please use GTM_DPLL_DT_S47.
*/
#define	GTM_DT_S47	(GTM_DPLL_DT_S47)

/** \\brief  289C0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S48 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289C0u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S48.
* To use register names with standard convension, please use GTM_DPLL_DT_S48.
*/
#define	GTM_DT_S48	(GTM_DPLL_DT_S48)

/** \\brief  289C4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S49 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289C4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S49.
* To use register names with standard convension, please use GTM_DPLL_DT_S49.
*/
#define	GTM_DT_S49	(GTM_DPLL_DT_S49)

/** \\brief  28914, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128914u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S5.
* To use register names with standard convension, please use GTM_DPLL_DT_S5.
*/
#define	GTM_DT_S5	(GTM_DPLL_DT_S5)

/** \\brief  289C8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S50 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289C8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S50.
* To use register names with standard convension, please use GTM_DPLL_DT_S50.
*/
#define	GTM_DT_S50	(GTM_DPLL_DT_S50)

/** \\brief  289CC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S51 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289CCu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S51.
* To use register names with standard convension, please use GTM_DPLL_DT_S51.
*/
#define	GTM_DT_S51	(GTM_DPLL_DT_S51)

/** \\brief  289D0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S52 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289D0u)

