summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_DT_S52.
* To use register names with standard convension, please use GTM_DPLL_DT_S52.
*/
#define	GTM_DT_S52	(GTM_DPLL_DT_S52)

/** \\brief  289D4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S53 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289D4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S53.
* To use register names with standard convension, please use GTM_DPLL_DT_S53.
*/
#define	GTM_DT_S53	(GTM_DPLL_DT_S53)

/** \\brief  289D8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S54 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289D8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S54.
* To use register names with standard convension, please use GTM_DPLL_DT_S54.
*/
#define	GTM_DT_S54	(GTM_DPLL_DT_S54)

/** \\brief  289DC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S55 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289DCu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S55.
* To use register names with standard convension, please use GTM_DPLL_DT_S55.
*/
#define	GTM_DT_S55	(GTM_DPLL_DT_S55)

/** \\brief  289E0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S56 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289E0u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S56.
* To use register names with standard convension, please use GTM_DPLL_DT_S56.
*/
#define	GTM_DT_S56	(GTM_DPLL_DT_S56)

/** \\brief  289E4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S57 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289E4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S57.
* To use register names with standard convension, please use GTM_DPLL_DT_S57.
*/
#define	GTM_DT_S57	(GTM_DPLL_DT_S57)

/** \\brief  289E8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S58 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289E8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S58.
* To use register names with standard convension, please use GTM_DPLL_DT_S58.
*/
#define	GTM_DT_S58	(GTM_DPLL_DT_S58)

/** \\brief  289EC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S59 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289ECu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S59.
* To use register names with standard convension, please use GTM_DPLL_DT_S59.
*/
#define	GTM_DT_S59	(GTM_DPLL_DT_S59)

/** \\brief  28918, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128918u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S6.
* To use register names with standard convension, please use GTM_DPLL_DT_S6.
*/
#define	GTM_DT_S6	(GTM_DPLL_DT_S6)

/** \\brief  289F0, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S60 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289F0u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S60.
* To use register names with standard convension, please use GTM_DPLL_DT_S60.
*/
#define	GTM_DT_S60	(GTM_DPLL_DT_S60)

/** \\brief  289F4, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S61 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289F4u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S61.
* To use register names with standard convension, please use GTM_DPLL_DT_S61.
*/
#define	GTM_DT_S61	(GTM_DPLL_DT_S61)

/** \\brief  289F8, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S62 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289F8u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S62.
* To use register names with standard convension, please use GTM_DPLL_DT_S62.
*/
#define	GTM_DT_S62	(GTM_DPLL_DT_S62)

/** \\brief  289FC, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S63 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF01289FCu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S63.
* To use register names with standard convension, please use GTM_DPLL_DT_S63.
*/
#define	GTM_DT_S63	(GTM_DPLL_DT_S63)

/** \\brief  2891C, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF012891Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S7.
* To use register names with standard convension, please use GTM_DPLL_DT_S7.
*/
#define	GTM_DT_S7	(GTM_DPLL_DT_S7)

/** \\brief  28920, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128920u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S8.
* To use register names with standard convension, please use GTM_DPLL_DT_S8.
*/
#define	GTM_DT_S8	(GTM_DPLL_DT_S8)

/** \\brief  28924, Nominal STATE Increment Values for FULL_SCALE */
#define GTM_DPLL_DT_S9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S*)0xF0128924u)

/** Alias (User Manual Name) for GTM_DPLL_DT_S9.
* To use register names with standard convension, please use GTM_DPLL_DT_S9.
*/
#define	GTM_DT_S9	(GTM_DPLL_DT_S9)

/** \\brief  2847C, Duration of Last STATE Increment [DT_S_ACT] */
#define GTM_DPLL_DT_S_ACT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_S_ACT*)0xF012847Cu)

/** Alias (User Manual Name) for GTM_DPLL_DT_S_ACT.
* To use register names with standard convension, please use GTM_DPLL_DT_S_ACT.
*/
#define	GTM_DT_S_ACT	(GTM_DPLL_DT_S_ACT)

/** \\brief  28478, Duration of Last TRIGGER Increment */
#define GTM_DPLL_DT_T_ACT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DT_T_ACT*)0xF0128478u)

/** Alias (User Manual Name) for GTM_DPLL_DT_T_ACT.
* To use register names with standard convension, please use GTM_DPLL_DT_T_ACT.
*/
#define	GTM_DT_T_ACT	(GTM_DPLL_DT_T_ACT)

/** \\brief  28380, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128380u)

/** Alias (User Manual Name) for GTM_DPLL_DTA0.
* To use register names with standard convension, please use GTM_DPLL_DTA0.
*/
#define	GTM_DTA0	(GTM_DPLL_DTA0)

/** \\brief  28384, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128384u)

