summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_DTA1.
* To use register names with standard convension, please use GTM_DPLL_DTA1.
*/
#define	GTM_DTA1	(GTM_DPLL_DTA1)

/** \\brief  283A8, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283A8u)

/** Alias (User Manual Name) for GTM_DPLL_DTA10.
* To use register names with standard convension, please use GTM_DPLL_DTA10.
*/
#define	GTM_DTA10	(GTM_DPLL_DTA10)

/** \\brief  283AC, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283ACu)

/** Alias (User Manual Name) for GTM_DPLL_DTA11.
* To use register names with standard convension, please use GTM_DPLL_DTA11.
*/
#define	GTM_DTA11	(GTM_DPLL_DTA11)

/** \\brief  283B0, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283B0u)

/** Alias (User Manual Name) for GTM_DPLL_DTA12.
* To use register names with standard convension, please use GTM_DPLL_DTA12.
*/
#define	GTM_DTA12	(GTM_DPLL_DTA12)

/** \\brief  283B4, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283B4u)

/** Alias (User Manual Name) for GTM_DPLL_DTA13.
* To use register names with standard convension, please use GTM_DPLL_DTA13.
*/
#define	GTM_DTA13	(GTM_DPLL_DTA13)

/** \\brief  283B8, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283B8u)

/** Alias (User Manual Name) for GTM_DPLL_DTA14.
* To use register names with standard convension, please use GTM_DPLL_DTA14.
*/
#define	GTM_DTA14	(GTM_DPLL_DTA14)

/** \\brief  283BC, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283BCu)

/** Alias (User Manual Name) for GTM_DPLL_DTA15.
* To use register names with standard convension, please use GTM_DPLL_DTA15.
*/
#define	GTM_DTA15	(GTM_DPLL_DTA15)

/** \\brief  283C0, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283C0u)

/** Alias (User Manual Name) for GTM_DPLL_DTA16.
* To use register names with standard convension, please use GTM_DPLL_DTA16.
*/
#define	GTM_DTA16	(GTM_DPLL_DTA16)

/** \\brief  283C4, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283C4u)

/** Alias (User Manual Name) for GTM_DPLL_DTA17.
* To use register names with standard convension, please use GTM_DPLL_DTA17.
*/
#define	GTM_DTA17	(GTM_DPLL_DTA17)

/** \\brief  283C8, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283C8u)

/** Alias (User Manual Name) for GTM_DPLL_DTA18.
* To use register names with standard convension, please use GTM_DPLL_DTA18.
*/
#define	GTM_DTA18	(GTM_DPLL_DTA18)

/** \\brief  283CC, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283CCu)

/** Alias (User Manual Name) for GTM_DPLL_DTA19.
* To use register names with standard convension, please use GTM_DPLL_DTA19.
*/
#define	GTM_DTA19	(GTM_DPLL_DTA19)

/** \\brief  28388, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128388u)

/** Alias (User Manual Name) for GTM_DPLL_DTA2.
* To use register names with standard convension, please use GTM_DPLL_DTA2.
*/
#define	GTM_DTA2	(GTM_DPLL_DTA2)

/** \\brief  283D0, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283D0u)

/** Alias (User Manual Name) for GTM_DPLL_DTA20.
* To use register names with standard convension, please use GTM_DPLL_DTA20.
*/
#define	GTM_DTA20	(GTM_DPLL_DTA20)

/** \\brief  283D4, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283D4u)

/** Alias (User Manual Name) for GTM_DPLL_DTA21.
* To use register names with standard convension, please use GTM_DPLL_DTA21.
*/
#define	GTM_DTA21	(GTM_DPLL_DTA21)

/** \\brief  283D8, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283D8u)

/** Alias (User Manual Name) for GTM_DPLL_DTA22.
* To use register names with standard convension, please use GTM_DPLL_DTA22.
*/
#define	GTM_DTA22	(GTM_DPLL_DTA22)

/** \\brief  283DC, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283DCu)

/** Alias (User Manual Name) for GTM_DPLL_DTA23.
* To use register names with standard convension, please use GTM_DPLL_DTA23.
*/
#define	GTM_DTA23	(GTM_DPLL_DTA23)

/** \\brief  2838C, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF012838Cu)

/** Alias (User Manual Name) for GTM_DPLL_DTA3.
* To use register names with standard convension, please use GTM_DPLL_DTA3.
*/
#define	GTM_DTA3	(GTM_DPLL_DTA3)

/** \\brief  28390, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128390u)

/** Alias (User Manual Name) for GTM_DPLL_DTA4.
* To use register names with standard convension, please use GTM_DPLL_DTA4.
*/
#define	GTM_DTA4	(GTM_DPLL_DTA4)

/** \\brief  28394, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128394u)

/** Alias (User Manual Name) for GTM_DPLL_DTA5.
* To use register names with standard convension, please use GTM_DPLL_DTA5.
*/
#define	GTM_DTA5	(GTM_DPLL_DTA5)

/** \\brief  28398, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF0128398u)

/** Alias (User Manual Name) for GTM_DPLL_DTA6.
* To use register names with standard convension, please use GTM_DPLL_DTA6.
*/
#define	GTM_DTA6	(GTM_DPLL_DTA6)

/** \\brief  2839C, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF012839Cu)

/** Alias (User Manual Name) for GTM_DPLL_DTA7.
* To use register names with standard convension, please use GTM_DPLL_DTA7.
*/
#define	GTM_DTA7	(GTM_DPLL_DTA7)

/** \\brief  283A0, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283A0u)

/** Alias (User Manual Name) for GTM_DPLL_DTA8.
* To use register names with standard convension, please use GTM_DPLL_DTA8.
*/
#define	GTM_DTA8	(GTM_DPLL_DTA8)

/** \\brief  283A4, Calculated Relative Time To ACTION_i Register */
#define GTM_DPLL_DTA9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_DTA*)0xF01283A4u)

