summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_NA1.
* To use register names with standard convension, please use GTM_DPLL_NA1.
*/
#define	GTM_NA1	(GTM_DPLL_NA1)

/** \\brief  28328, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128328u)

/** Alias (User Manual Name) for GTM_DPLL_NA10.
* To use register names with standard convension, please use GTM_DPLL_NA10.
*/
#define	GTM_NA10	(GTM_DPLL_NA10)

/** \\brief  2832C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012832Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA11.
* To use register names with standard convension, please use GTM_DPLL_NA11.
*/
#define	GTM_NA11	(GTM_DPLL_NA11)

/** \\brief  28330, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128330u)

/** Alias (User Manual Name) for GTM_DPLL_NA12.
* To use register names with standard convension, please use GTM_DPLL_NA12.
*/
#define	GTM_NA12	(GTM_DPLL_NA12)

/** \\brief  28334, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128334u)

/** Alias (User Manual Name) for GTM_DPLL_NA13.
* To use register names with standard convension, please use GTM_DPLL_NA13.
*/
#define	GTM_NA13	(GTM_DPLL_NA13)

/** \\brief  28338, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128338u)

/** Alias (User Manual Name) for GTM_DPLL_NA14.
* To use register names with standard convension, please use GTM_DPLL_NA14.
*/
#define	GTM_NA14	(GTM_DPLL_NA14)

/** \\brief  2833C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012833Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA15.
* To use register names with standard convension, please use GTM_DPLL_NA15.
*/
#define	GTM_NA15	(GTM_DPLL_NA15)

/** \\brief  28340, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128340u)

/** Alias (User Manual Name) for GTM_DPLL_NA16.
* To use register names with standard convension, please use GTM_DPLL_NA16.
*/
#define	GTM_NA16	(GTM_DPLL_NA16)

/** \\brief  28344, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128344u)

/** Alias (User Manual Name) for GTM_DPLL_NA17.
* To use register names with standard convension, please use GTM_DPLL_NA17.
*/
#define	GTM_NA17	(GTM_DPLL_NA17)

/** \\brief  28348, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128348u)

/** Alias (User Manual Name) for GTM_DPLL_NA18.
* To use register names with standard convension, please use GTM_DPLL_NA18.
*/
#define	GTM_NA18	(GTM_DPLL_NA18)

/** \\brief  2834C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012834Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA19.
* To use register names with standard convension, please use GTM_DPLL_NA19.
*/
#define	GTM_NA19	(GTM_DPLL_NA19)

/** \\brief  28308, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128308u)

/** Alias (User Manual Name) for GTM_DPLL_NA2.
* To use register names with standard convension, please use GTM_DPLL_NA2.
*/
#define	GTM_NA2	(GTM_DPLL_NA2)

/** \\brief  28350, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128350u)

/** Alias (User Manual Name) for GTM_DPLL_NA20.
* To use register names with standard convension, please use GTM_DPLL_NA20.
*/
#define	GTM_NA20	(GTM_DPLL_NA20)

/** \\brief  28354, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128354u)

/** Alias (User Manual Name) for GTM_DPLL_NA21.
* To use register names with standard convension, please use GTM_DPLL_NA21.
*/
#define	GTM_NA21	(GTM_DPLL_NA21)

/** \\brief  28358, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128358u)

/** Alias (User Manual Name) for GTM_DPLL_NA22.
* To use register names with standard convension, please use GTM_DPLL_NA22.
*/
#define	GTM_NA22	(GTM_DPLL_NA22)

/** \\brief  2835C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012835Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA23.
* To use register names with standard convension, please use GTM_DPLL_NA23.
*/
#define	GTM_NA23	(GTM_DPLL_NA23)

/** \\brief  2830C, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF012830Cu)

/** Alias (User Manual Name) for GTM_DPLL_NA3.
* To use register names with standard convension, please use GTM_DPLL_NA3.
*/
#define	GTM_NA3	(GTM_DPLL_NA3)

/** \\brief  28310, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128310u)

/** Alias (User Manual Name) for GTM_DPLL_NA4.
* To use register names with standard convension, please use GTM_DPLL_NA4.
*/
#define	GTM_NA4	(GTM_DPLL_NA4)

/** \\brief  28314, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128314u)

/** Alias (User Manual Name) for GTM_DPLL_NA5.
* To use register names with standard convension, please use GTM_DPLL_NA5.
*/
#define	GTM_NA5	(GTM_DPLL_NA5)

/** \\brief  28318, Calculated Number Of TRIGGER/STATE Increments To ACTION */
#define GTM_DPLL_NA6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_NA*)0xF0128318u)

/** Alias (User Manual Name) for GTM_DPLL_NA6.
* To use register names with standard convension, please use GTM_DPLL_NA6.
*/
#define	GTM_NA6	(GTM_DPLL_NA6)

