summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** \\brief  2853C, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012853Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T15.
* To use register names with standard convension, please use GTM_DPLL_PDT_T15.
*/
#define	GTM_PDT_T15	(GTM_DPLL_PDT_T15)

/** \\brief  28540, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128540u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T16.
* To use register names with standard convension, please use GTM_DPLL_PDT_T16.
*/
#define	GTM_PDT_T16	(GTM_DPLL_PDT_T16)

/** \\brief  28544, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128544u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T17.
* To use register names with standard convension, please use GTM_DPLL_PDT_T17.
*/
#define	GTM_PDT_T17	(GTM_DPLL_PDT_T17)

/** \\brief  28548, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128548u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T18.
* To use register names with standard convension, please use GTM_DPLL_PDT_T18.
*/
#define	GTM_PDT_T18	(GTM_DPLL_PDT_T18)

/** \\brief  2854C, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012854Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T19.
* To use register names with standard convension, please use GTM_DPLL_PDT_T19.
*/
#define	GTM_PDT_T19	(GTM_DPLL_PDT_T19)

/** \\brief  28508, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128508u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T2.
* To use register names with standard convension, please use GTM_DPLL_PDT_T2.
*/
#define	GTM_PDT_T2	(GTM_DPLL_PDT_T2)

/** \\brief  28550, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128550u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T20.
* To use register names with standard convension, please use GTM_DPLL_PDT_T20.
*/
#define	GTM_PDT_T20	(GTM_DPLL_PDT_T20)

/** \\brief  28554, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128554u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T21.
* To use register names with standard convension, please use GTM_DPLL_PDT_T21.
*/
#define	GTM_PDT_T21	(GTM_DPLL_PDT_T21)

/** \\brief  28558, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128558u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T22.
* To use register names with standard convension, please use GTM_DPLL_PDT_T22.
*/
#define	GTM_PDT_T22	(GTM_DPLL_PDT_T22)

/** \\brief  2855C, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012855Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T23.
* To use register names with standard convension, please use GTM_DPLL_PDT_T23.
*/
#define	GTM_PDT_T23	(GTM_DPLL_PDT_T23)

/** \\brief  2850C, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012850Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T3.
* To use register names with standard convension, please use GTM_DPLL_PDT_T3.
*/
#define	GTM_PDT_T3	(GTM_DPLL_PDT_T3)

/** \\brief  28510, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128510u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T4.
* To use register names with standard convension, please use GTM_DPLL_PDT_T4.
*/
#define	GTM_PDT_T4	(GTM_DPLL_PDT_T4)

/** \\brief  28514, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128514u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T5.
* To use register names with standard convension, please use GTM_DPLL_PDT_T5.
*/
#define	GTM_PDT_T5	(GTM_DPLL_PDT_T5)

/** \\brief  28518, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128518u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T6.
* To use register names with standard convension, please use GTM_DPLL_PDT_T6.
*/
#define	GTM_PDT_T6	(GTM_DPLL_PDT_T6)

/** \\brief  2851C, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF012851Cu)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T7.
* To use register names with standard convension, please use GTM_DPLL_PDT_T7.
*/
#define	GTM_PDT_T7	(GTM_DPLL_PDT_T7)

/** \\brief  28520, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128520u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T8.
* To use register names with standard convension, please use GTM_DPLL_PDT_T8.
*/
#define	GTM_PDT_T8	(GTM_DPLL_PDT_T8)

/** \\brief  28524, Projected TRIGGER Increment Sum Relations for Action_i */
#define GTM_DPLL_PDT_T9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PDT_T*)0xF0128524u)

/** Alias (User Manual Name) for GTM_DPLL_PDT_T9.
* To use register names with standard convension, please use GTM_DPLL_PDT_T9.
*/
#define	GTM_PDT_T9	(GTM_DPLL_PDT_T9)

/** \\brief  28200, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128200u)

/** Alias (User Manual Name) for GTM_DPLL_PSA0.
* To use register names with standard convension, please use GTM_DPLL_PSA0.
*/
#define	GTM_PSA0	(GTM_DPLL_PSA0)

