summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** \\brief  28204, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128204u)

/** Alias (User Manual Name) for GTM_DPLL_PSA1.
* To use register names with standard convension, please use GTM_DPLL_PSA1.
*/
#define	GTM_PSA1	(GTM_DPLL_PSA1)

/** \\brief  28228, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128228u)

/** Alias (User Manual Name) for GTM_DPLL_PSA10.
* To use register names with standard convension, please use GTM_DPLL_PSA10.
*/
#define	GTM_PSA10	(GTM_DPLL_PSA10)

/** \\brief  2822C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012822Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA11.
* To use register names with standard convension, please use GTM_DPLL_PSA11.
*/
#define	GTM_PSA11	(GTM_DPLL_PSA11)

/** \\brief  28230, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128230u)

/** Alias (User Manual Name) for GTM_DPLL_PSA12.
* To use register names with standard convension, please use GTM_DPLL_PSA12.
*/
#define	GTM_PSA12	(GTM_DPLL_PSA12)

/** \\brief  28234, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128234u)

/** Alias (User Manual Name) for GTM_DPLL_PSA13.
* To use register names with standard convension, please use GTM_DPLL_PSA13.
*/
#define	GTM_PSA13	(GTM_DPLL_PSA13)

/** \\brief  28238, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128238u)

/** Alias (User Manual Name) for GTM_DPLL_PSA14.
* To use register names with standard convension, please use GTM_DPLL_PSA14.
*/
#define	GTM_PSA14	(GTM_DPLL_PSA14)

/** \\brief  2823C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012823Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA15.
* To use register names with standard convension, please use GTM_DPLL_PSA15.
*/
#define	GTM_PSA15	(GTM_DPLL_PSA15)

/** \\brief  28240, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128240u)

/** Alias (User Manual Name) for GTM_DPLL_PSA16.
* To use register names with standard convension, please use GTM_DPLL_PSA16.
*/
#define	GTM_PSA16	(GTM_DPLL_PSA16)

/** \\brief  28244, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128244u)

/** Alias (User Manual Name) for GTM_DPLL_PSA17.
* To use register names with standard convension, please use GTM_DPLL_PSA17.
*/
#define	GTM_PSA17	(GTM_DPLL_PSA17)

/** \\brief  28248, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128248u)

/** Alias (User Manual Name) for GTM_DPLL_PSA18.
* To use register names with standard convension, please use GTM_DPLL_PSA18.
*/
#define	GTM_PSA18	(GTM_DPLL_PSA18)

/** \\brief  2824C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012824Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA19.
* To use register names with standard convension, please use GTM_DPLL_PSA19.
*/
#define	GTM_PSA19	(GTM_DPLL_PSA19)

/** \\brief  28208, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128208u)

/** Alias (User Manual Name) for GTM_DPLL_PSA2.
* To use register names with standard convension, please use GTM_DPLL_PSA2.
*/
#define	GTM_PSA2	(GTM_DPLL_PSA2)

/** \\brief  28250, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128250u)

/** Alias (User Manual Name) for GTM_DPLL_PSA20.
* To use register names with standard convension, please use GTM_DPLL_PSA20.
*/
#define	GTM_PSA20	(GTM_DPLL_PSA20)

/** \\brief  28254, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128254u)

/** Alias (User Manual Name) for GTM_DPLL_PSA21.
* To use register names with standard convension, please use GTM_DPLL_PSA21.
*/
#define	GTM_PSA21	(GTM_DPLL_PSA21)

/** \\brief  28258, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128258u)

/** Alias (User Manual Name) for GTM_DPLL_PSA22.
* To use register names with standard convension, please use GTM_DPLL_PSA22.
*/
#define	GTM_PSA22	(GTM_DPLL_PSA22)

/** \\brief  2825C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012825Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA23.
* To use register names with standard convension, please use GTM_DPLL_PSA23.
*/
#define	GTM_PSA23	(GTM_DPLL_PSA23)

/** \\brief  2820C, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF012820Cu)

/** Alias (User Manual Name) for GTM_DPLL_PSA3.
* To use register names with standard convension, please use GTM_DPLL_PSA3.
*/
#define	GTM_PSA3	(GTM_DPLL_PSA3)

/** \\brief  28210, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128210u)

/** Alias (User Manual Name) for GTM_DPLL_PSA4.
* To use register names with standard convension, please use GTM_DPLL_PSA4.
*/
#define	GTM_PSA4	(GTM_DPLL_PSA4)

/** \\brief  28214, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128214u)

/** Alias (User Manual Name) for GTM_DPLL_PSA5.
* To use register names with standard convension, please use GTM_DPLL_PSA5.
*/
#define	GTM_PSA5	(GTM_DPLL_PSA5)

/** \\brief  28218, ACTION Position/Value Action Request Register */
#define GTM_DPLL_PSA6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSA*)0xF0128218u)

