summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** \\brief  285E0, Actual Calculated Position Stamp of Last TRIGGER Input */
#define GTM_DPLL_PSTC /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSTC*)0xF01285E0u)

/** Alias (User Manual Name) for GTM_DPLL_PSTC.
* To use register names with standard convension, please use GTM_DPLL_PSTC.
*/
#define	GTM_PSTC	(GTM_DPLL_PSTC)

/** \\brief  285E8, Measured Position Stamp of Last TRIGGER Input */
#define GTM_DPLL_PSTM_0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSTM_0*)0xF01285E8u)

/** Alias (User Manual Name) for GTM_DPLL_PSTM_0.
* To use register names with standard convension, please use GTM_DPLL_PSTM_0.
*/
#define	GTM_PSTM_OLD_1	(GTM_DPLL_PSTM_0)

/** Alias (User Manual Name) for GTM_DPLL_PSTM_0.
* To use register names with standard convension, please use GTM_DPLL_PSTM_0.
*/
#define	GTM_PSTM_0	(GTM_DPLL_PSTM_0)

/** \\brief  285EC, Measured Position Stamp of Last TRIGGER Input */
#define GTM_DPLL_PSTM_1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PSTM_1*)0xF01285ECu)

/** Alias (User Manual Name) for GTM_DPLL_PSTM_1.
* To use register names with standard convension, please use GTM_DPLL_PSTM_1.
*/
#define	GTM_PSTM_1	(GTM_DPLL_PSTM_1)

/** Alias (User Manual Name) for GTM_DPLL_PSTM_1.
* To use register names with standard convension, please use GTM_DPLL_PSTM_1.
*/
#define	GTM_PSTM_OLD_0	(GTM_DPLL_PSTM_1)

/** \\brief  285D0, Plausibility Value of Next Active TRIGGER Slope */
#define GTM_DPLL_PVT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_PVT*)0xF01285D0u)

/** Alias (User Manual Name) for GTM_DPLL_PVT.
* To use register names with standard convension, please use GTM_DPLL_PVT.
*/
#define	GTM_PVT	(GTM_DPLL_PVT)

/** \\brief  281FC, DPLL RAM Initatlisation Register */
#define GTM_DPLL_RAM_INI /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RAM_INI*)0xF01281FCu)

/** \\brief  28464, Reciprocal Value of Expected Increment Duration STATE */
#define GTM_DPLL_RCDT_SX /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_SX*)0xF0128464u)

/** Alias (User Manual Name) for GTM_DPLL_RCDT_SX.
* To use register names with standard convension, please use GTM_DPLL_RCDT_SX.
*/
#define	GTM_RCDT_SX	(GTM_DPLL_RCDT_SX)

/** \\brief  2846C, Reciprocal Value of the Expected Nominal Increment Duration
 * STATE */
#define GTM_DPLL_RCDT_SX_NOM /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_SX_NOM*)0xF012846Cu)

/** Alias (User Manual Name) for GTM_DPLL_RCDT_SX_NOM.
* To use register names with standard convension, please use GTM_DPLL_RCDT_SX_NOM.
*/
#define	GTM_RCDT_SX_NOM	(GTM_DPLL_RCDT_SX_NOM)

/** \\brief  28460, Reciprocal Value of Expected Increment Duration TRIGGER */
#define GTM_DPLL_RCDT_TX /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_TX*)0xF0128460u)

/** Alias (User Manual Name) for GTM_DPLL_RCDT_TX.
* To use register names with standard convension, please use GTM_DPLL_RCDT_TX.
*/
#define	GTM_RCDT_TX	(GTM_DPLL_RCDT_TX)

/** \\brief  28468, Reciprocal Value of the Expected Nominal Increment Duration
 * TRIGGER */
#define GTM_DPLL_RCDT_TX_NOM /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RCDT_TX_NOM*)0xF0128468u)

/** Alias (User Manual Name) for GTM_DPLL_RCDT_TX_NOM.
* To use register names with standard convension, please use GTM_DPLL_RCDT_TX_NOM.
*/
#define	GTM_RCDT_TX_NOM	(GTM_DPLL_RCDT_TX_NOM)

/** \\brief  28600, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128600u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S0.
* To use register names with standard convension, please use GTM_DPLL_RDT_S0.
*/
#define	GTM_RDT_S0	(GTM_DPLL_RDT_S0)

/** \\brief  28604, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128604u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S1.
* To use register names with standard convension, please use GTM_DPLL_RDT_S1.
*/
#define	GTM_RDT_S1	(GTM_DPLL_RDT_S1)

/** \\brief  28628, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128628u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S10.
* To use register names with standard convension, please use GTM_DPLL_RDT_S10.
*/
#define	GTM_RDT_S10	(GTM_DPLL_RDT_S10)

/** \\brief  2862C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012862Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S11.
* To use register names with standard convension, please use GTM_DPLL_RDT_S11.
*/
#define	GTM_RDT_S11	(GTM_DPLL_RDT_S11)

/** \\brief  28630, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128630u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S12.
* To use register names with standard convension, please use GTM_DPLL_RDT_S12.
*/
#define	GTM_RDT_S12	(GTM_DPLL_RDT_S12)

/** \\brief  28634, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128634u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S13.
* To use register names with standard convension, please use GTM_DPLL_RDT_S13.
*/
#define	GTM_RDT_S13	(GTM_DPLL_RDT_S13)

/** \\brief  28638, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128638u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S14.
* To use register names with standard convension, please use GTM_DPLL_RDT_S14.
*/
#define	GTM_RDT_S14	(GTM_DPLL_RDT_S14)

/** \\brief  2863C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012863Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S15.
* To use register names with standard convension, please use GTM_DPLL_RDT_S15.
*/
#define	GTM_RDT_S15	(GTM_DPLL_RDT_S15)

/** \\brief  28640, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128640u)

