summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_RDT_S16.
* To use register names with standard convension, please use GTM_DPLL_RDT_S16.
*/
#define	GTM_RDT_S16	(GTM_DPLL_RDT_S16)

/** \\brief  28644, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128644u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S17.
* To use register names with standard convension, please use GTM_DPLL_RDT_S17.
*/
#define	GTM_RDT_S17	(GTM_DPLL_RDT_S17)

/** \\brief  28648, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128648u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S18.
* To use register names with standard convension, please use GTM_DPLL_RDT_S18.
*/
#define	GTM_RDT_S18	(GTM_DPLL_RDT_S18)

/** \\brief  2864C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012864Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S19.
* To use register names with standard convension, please use GTM_DPLL_RDT_S19.
*/
#define	GTM_RDT_S19	(GTM_DPLL_RDT_S19)

/** \\brief  28608, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128608u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S2.
* To use register names with standard convension, please use GTM_DPLL_RDT_S2.
*/
#define	GTM_RDT_S2	(GTM_DPLL_RDT_S2)

/** \\brief  28650, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128650u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S20.
* To use register names with standard convension, please use GTM_DPLL_RDT_S20.
*/
#define	GTM_RDT_S20	(GTM_DPLL_RDT_S20)

/** \\brief  28654, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S21 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128654u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S21.
* To use register names with standard convension, please use GTM_DPLL_RDT_S21.
*/
#define	GTM_RDT_S21	(GTM_DPLL_RDT_S21)

/** \\brief  28658, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S22 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128658u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S22.
* To use register names with standard convension, please use GTM_DPLL_RDT_S22.
*/
#define	GTM_RDT_S22	(GTM_DPLL_RDT_S22)

/** \\brief  2865C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S23 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012865Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S23.
* To use register names with standard convension, please use GTM_DPLL_RDT_S23.
*/
#define	GTM_RDT_S23	(GTM_DPLL_RDT_S23)

/** \\brief  28660, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S24 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128660u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S24.
* To use register names with standard convension, please use GTM_DPLL_RDT_S24.
*/
#define	GTM_RDT_S24	(GTM_DPLL_RDT_S24)

/** \\brief  28664, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S25 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128664u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S25.
* To use register names with standard convension, please use GTM_DPLL_RDT_S25.
*/
#define	GTM_RDT_S25	(GTM_DPLL_RDT_S25)

/** \\brief  28668, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S26 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128668u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S26.
* To use register names with standard convension, please use GTM_DPLL_RDT_S26.
*/
#define	GTM_RDT_S26	(GTM_DPLL_RDT_S26)

/** \\brief  2866C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S27 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012866Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S27.
* To use register names with standard convension, please use GTM_DPLL_RDT_S27.
*/
#define	GTM_RDT_S27	(GTM_DPLL_RDT_S27)

/** \\brief  28670, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S28 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128670u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S28.
* To use register names with standard convension, please use GTM_DPLL_RDT_S28.
*/
#define	GTM_RDT_S28	(GTM_DPLL_RDT_S28)

/** \\brief  28674, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S29 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128674u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S29.
* To use register names with standard convension, please use GTM_DPLL_RDT_S29.
*/
#define	GTM_RDT_S29	(GTM_DPLL_RDT_S29)

/** \\brief  2860C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S3 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012860Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S3.
* To use register names with standard convension, please use GTM_DPLL_RDT_S3.
*/
#define	GTM_RDT_S3	(GTM_DPLL_RDT_S3)

/** \\brief  28678, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S30 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128678u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S30.
* To use register names with standard convension, please use GTM_DPLL_RDT_S30.
*/
#define	GTM_RDT_S30	(GTM_DPLL_RDT_S30)

/** \\brief  2867C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S31 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012867Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S31.
* To use register names with standard convension, please use GTM_DPLL_RDT_S31.
*/
#define	GTM_RDT_S31	(GTM_DPLL_RDT_S31)

/** \\brief  28680, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S32 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128680u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S32.
* To use register names with standard convension, please use GTM_DPLL_RDT_S32.
*/
#define	GTM_RDT_S32	(GTM_DPLL_RDT_S32)

/** \\brief  28684, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S33 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128684u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S33.
* To use register names with standard convension, please use GTM_DPLL_RDT_S33.
*/
#define	GTM_RDT_S33	(GTM_DPLL_RDT_S33)

/** \\brief  28688, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S34 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128688u)

