summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_RDT_S34.
* To use register names with standard convension, please use GTM_DPLL_RDT_S34.
*/
#define	GTM_RDT_S34	(GTM_DPLL_RDT_S34)

/** \\brief  2868C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S35 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012868Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S35.
* To use register names with standard convension, please use GTM_DPLL_RDT_S35.
*/
#define	GTM_RDT_S35	(GTM_DPLL_RDT_S35)

/** \\brief  28690, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S36 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128690u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S36.
* To use register names with standard convension, please use GTM_DPLL_RDT_S36.
*/
#define	GTM_RDT_S36	(GTM_DPLL_RDT_S36)

/** \\brief  28694, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S37 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128694u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S37.
* To use register names with standard convension, please use GTM_DPLL_RDT_S37.
*/
#define	GTM_RDT_S37	(GTM_DPLL_RDT_S37)

/** \\brief  28698, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S38 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128698u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S38.
* To use register names with standard convension, please use GTM_DPLL_RDT_S38.
*/
#define	GTM_RDT_S38	(GTM_DPLL_RDT_S38)

/** \\brief  2869C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S39 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012869Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S39.
* To use register names with standard convension, please use GTM_DPLL_RDT_S39.
*/
#define	GTM_RDT_S39	(GTM_DPLL_RDT_S39)

/** \\brief  28610, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S4 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128610u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S4.
* To use register names with standard convension, please use GTM_DPLL_RDT_S4.
*/
#define	GTM_RDT_S4	(GTM_DPLL_RDT_S4)

/** \\brief  286A0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S40 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286A0u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S40.
* To use register names with standard convension, please use GTM_DPLL_RDT_S40.
*/
#define	GTM_RDT_S40	(GTM_DPLL_RDT_S40)

/** \\brief  286A4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S41 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286A4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S41.
* To use register names with standard convension, please use GTM_DPLL_RDT_S41.
*/
#define	GTM_RDT_S41	(GTM_DPLL_RDT_S41)

/** \\brief  286A8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S42 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286A8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S42.
* To use register names with standard convension, please use GTM_DPLL_RDT_S42.
*/
#define	GTM_RDT_S42	(GTM_DPLL_RDT_S42)

/** \\brief  286AC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S43 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286ACu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S43.
* To use register names with standard convension, please use GTM_DPLL_RDT_S43.
*/
#define	GTM_RDT_S43	(GTM_DPLL_RDT_S43)

/** \\brief  286B0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S44 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286B0u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S44.
* To use register names with standard convension, please use GTM_DPLL_RDT_S44.
*/
#define	GTM_RDT_S44	(GTM_DPLL_RDT_S44)

/** \\brief  286B4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S45 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286B4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S45.
* To use register names with standard convension, please use GTM_DPLL_RDT_S45.
*/
#define	GTM_RDT_S45	(GTM_DPLL_RDT_S45)

/** \\brief  286B8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S46 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286B8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S46.
* To use register names with standard convension, please use GTM_DPLL_RDT_S46.
*/
#define	GTM_RDT_S46	(GTM_DPLL_RDT_S46)

/** \\brief  286BC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S47 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286BCu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S47.
* To use register names with standard convension, please use GTM_DPLL_RDT_S47.
*/
#define	GTM_RDT_S47	(GTM_DPLL_RDT_S47)

/** \\brief  286C0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S48 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286C0u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S48.
* To use register names with standard convension, please use GTM_DPLL_RDT_S48.
*/
#define	GTM_RDT_S48	(GTM_DPLL_RDT_S48)

/** \\brief  286C4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S49 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286C4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S49.
* To use register names with standard convension, please use GTM_DPLL_RDT_S49.
*/
#define	GTM_RDT_S49	(GTM_DPLL_RDT_S49)

/** \\brief  28614, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S5 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128614u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S5.
* To use register names with standard convension, please use GTM_DPLL_RDT_S5.
*/
#define	GTM_RDT_S5	(GTM_DPLL_RDT_S5)

/** \\brief  286C8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S50 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286C8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S50.
* To use register names with standard convension, please use GTM_DPLL_RDT_S50.
*/
#define	GTM_RDT_S50	(GTM_DPLL_RDT_S50)

