summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** \\brief  286CC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S51 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286CCu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S51.
* To use register names with standard convension, please use GTM_DPLL_RDT_S51.
*/
#define	GTM_RDT_S51	(GTM_DPLL_RDT_S51)

/** \\brief  286D0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S52 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286D0u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S52.
* To use register names with standard convension, please use GTM_DPLL_RDT_S52.
*/
#define	GTM_RDT_S52	(GTM_DPLL_RDT_S52)

/** \\brief  286D4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S53 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286D4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S53.
* To use register names with standard convension, please use GTM_DPLL_RDT_S53.
*/
#define	GTM_RDT_S53	(GTM_DPLL_RDT_S53)

/** \\brief  286D8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S54 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286D8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S54.
* To use register names with standard convension, please use GTM_DPLL_RDT_S54.
*/
#define	GTM_RDT_S54	(GTM_DPLL_RDT_S54)

/** \\brief  286DC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S55 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286DCu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S55.
* To use register names with standard convension, please use GTM_DPLL_RDT_S55.
*/
#define	GTM_RDT_S55	(GTM_DPLL_RDT_S55)

/** \\brief  286E0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S56 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286E0u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S56.
* To use register names with standard convension, please use GTM_DPLL_RDT_S56.
*/
#define	GTM_RDT_S56	(GTM_DPLL_RDT_S56)

/** \\brief  286E4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S57 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286E4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S57.
* To use register names with standard convension, please use GTM_DPLL_RDT_S57.
*/
#define	GTM_RDT_S57	(GTM_DPLL_RDT_S57)

/** \\brief  286E8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S58 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286E8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S58.
* To use register names with standard convension, please use GTM_DPLL_RDT_S58.
*/
#define	GTM_RDT_S58	(GTM_DPLL_RDT_S58)

/** \\brief  286EC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S59 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286ECu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S59.
* To use register names with standard convension, please use GTM_DPLL_RDT_S59.
*/
#define	GTM_RDT_S59	(GTM_DPLL_RDT_S59)

/** \\brief  28618, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S6 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128618u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S6.
* To use register names with standard convension, please use GTM_DPLL_RDT_S6.
*/
#define	GTM_RDT_S6	(GTM_DPLL_RDT_S6)

/** \\brief  286F0, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S60 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286F0u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S60.
* To use register names with standard convension, please use GTM_DPLL_RDT_S60.
*/
#define	GTM_RDT_S60	(GTM_DPLL_RDT_S60)

/** \\brief  286F4, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S61 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286F4u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S61.
* To use register names with standard convension, please use GTM_DPLL_RDT_S61.
*/
#define	GTM_RDT_S61	(GTM_DPLL_RDT_S61)

/** \\brief  286F8, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S62 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286F8u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S62.
* To use register names with standard convension, please use GTM_DPLL_RDT_S62.
*/
#define	GTM_RDT_S62	(GTM_DPLL_RDT_S62)

/** \\brief  286FC, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S63 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF01286FCu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S63.
* To use register names with standard convension, please use GTM_DPLL_RDT_S63.
*/
#define	GTM_RDT_S63	(GTM_DPLL_RDT_S63)

/** \\brief  2861C, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S7 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF012861Cu)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S7.
* To use register names with standard convension, please use GTM_DPLL_RDT_S7.
*/
#define	GTM_RDT_S7	(GTM_DPLL_RDT_S7)

/** \\brief  28620, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S8 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128620u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S8.
* To use register names with standard convension, please use GTM_DPLL_RDT_S8.
*/
#define	GTM_RDT_S8	(GTM_DPLL_RDT_S8)

/** \\brief  28624, Nominal STATE Reciprocal Values in FULL_SCALE */
#define GTM_DPLL_RDT_S9 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S*)0xF0128624u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S9.
* To use register names with standard convension, please use GTM_DPLL_RDT_S9.
*/
#define	GTM_RDT_S9	(GTM_DPLL_RDT_S9)

/** \\brief  28474, Actual Reciprocal Value of STATE */
#define GTM_DPLL_RDT_S_ACT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_S_ACT*)0xF0128474u)

/** Alias (User Manual Name) for GTM_DPLL_RDT_S_ACT.
* To use register names with standard convension, please use GTM_DPLL_RDT_S_ACT.
*/
#define	GTM_RDT_S_ACT	(GTM_DPLL_RDT_S_ACT)

/** \\brief  28470, Actual Reciprocal Value of TRIGGER */
#define GTM_DPLL_RDT_T_ACT /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_RDT_T_ACT*)0xF0128470u)

