summit677/embedded_automotive_software/EAS/EAS_environment/ee/pkg/mcu/infineon_tc26x/sfr/IfxGtm_reg.h
/** Alias (User Manual Name) for GTM_DPLL_RDT_T_ACT.
* To use register names with standard convension, please use GTM_DPLL_RDT_T_ACT.
*/
#define	GTM_RDT_T_ACT	(GTM_DPLL_RDT_T_ACT)

/** \\brief  284A4, STATE Locking Range */
#define GTM_DPLL_SLR /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_SLR*)0xF01284A4u)

/** Alias (User Manual Name) for GTM_DPLL_SLR.
* To use register names with standard convension, please use GTM_DPLL_SLR.
*/
#define	GTM_SLR	(GTM_DPLL_SLR)

/** \\brief  280FC, DPLL Status Register */
#define GTM_DPLL_STATUS /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_STATUS*)0xF01280FCu)

/** \\brief  280C4, DPLL TBU_TS0 Value at last STATE Event */
#define GTM_DPLL_TBU_TS0_S /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TBU_TS0_S*)0xF01280C4u)

/** Alias (User Manual Name) for GTM_DPLL_TBU_TS0_S.
* To use register names with standard convension, please use GTM_DPLL_TBU_TS0_S.
*/
#define	GTM_TBU_TS0_S	(GTM_DPLL_TBU_TS0_S)

/** \\brief  280C0, DPLL TBU_TS0 Value at last TRIGGER Event */
#define GTM_DPLL_TBU_TS0_T /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TBU_TS0_T*)0xF01280C0u)

/** Alias (User Manual Name) for GTM_DPLL_TBU_TS0_T.
* To use register names with standard convension, please use GTM_DPLL_TBU_TS0_T.
*/
#define	GTM_TBU_TS0_T	(GTM_DPLL_TBU_TS0_T)

/** \\brief  28424, TRIGGER Hold Time Max Value */
#define GTM_DPLL_THMA /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_THMA*)0xF0128424u)

/** Alias (User Manual Name) for GTM_DPLL_THMA.
* To use register names with standard convension, please use GTM_DPLL_THMA.
*/
#define	GTM_THMA	(GTM_DPLL_THMA)

/** \\brief  28420, TRIGGER hold time min value */
#define GTM_DPLL_THMI /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_THMI*)0xF0128420u)

/** Alias (User Manual Name) for GTM_DPLL_THMI.
* To use register names with standard convension, please use GTM_DPLL_THMI.
*/
#define	GTM_THMI	(GTM_DPLL_THMI)

/** \\brief  28428, Measured Last Pulse Time from Valid to Invalid TRIGGER Slope */
#define GTM_DPLL_THVAL /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_THVAL*)0xF0128428u)

/** Alias (User Manual Name) for GTM_DPLL_THVAL.
* To use register names with standard convension, please use GTM_DPLL_THVAL.
*/
#define	GTM_THVAL	(GTM_DPLL_THVAL)

/** \\brief  284A0, TRIGGER locking range */
#define GTM_DPLL_TLR /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TLR*)0xF01284A0u)

/** Alias (User Manual Name) for GTM_DPLL_TLR.
* To use register names with standard convension, please use GTM_DPLL_TLR.
*/
#define	GTM_TLR	(GTM_DPLL_TLR)

/** \\brief  28430, Time Out Value of active TRIGGER Slope */
#define GTM_DPLL_TOV /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TOV*)0xF0128430u)

/** Alias (User Manual Name) for GTM_DPLL_TOV.
* To use register names with standard convension, please use GTM_DPLL_TOV.
*/
#define	GTM_TOV	(GTM_DPLL_TOV)

/** \\brief  28434, Time Out Value of active STATE Slope */
#define GTM_DPLL_TOV_S /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TOV_S*)0xF0128434u)

/** Alias (User Manual Name) for GTM_DPLL_TOV_S.
* To use register names with standard convension, please use GTM_DPLL_TOV_S.
*/
#define	GTM_TOV_S	(GTM_DPLL_TOV_S)

/** \\brief  28408, Actual Signal TRIGGER Filter Value Register */
#define GTM_DPLL_TS_FTV_T /*lint --e(923)*/ (*(volatile Ifx_GTM_TS_FTV_T*)0xF0128408u)

/** Alias (User Manual Name) for GTM_DPLL_TS_FTV_T.
* To use register names with standard convension, please use GTM_DPLL_TS_FTV_T.
*/
#define	GTM_FTV_T	(GTM_DPLL_TS_FTV_T)

/** \\brief  28410, Actual Signal STATE Time Stamp Register */
#define GTM_DPLL_TS_S_0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TS_S_0*)0xF0128410u)

/** Alias (User Manual Name) for GTM_DPLL_TS_S_0.
* To use register names with standard convension, please use GTM_DPLL_TS_S_0.
*/
#define	GTM_TS_S_0	(GTM_DPLL_TS_S_0)

/** Alias (User Manual Name) for GTM_DPLL_TS_S_0.
* To use register names with standard convension, please use GTM_DPLL_TS_S_0.
*/
#define	GTM_TS_S_OLD_0	(GTM_DPLL_TS_S_0)

/** \\brief  28414, Actual Signal STATE Time Stamp Register */
#define GTM_DPLL_TS_S_1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TS_S_1*)0xF0128414u)

/** Alias (User Manual Name) for GTM_DPLL_TS_S_1.
* To use register names with standard convension, please use GTM_DPLL_TS_S_1.
*/
#define	GTM_TS_S_1	(GTM_DPLL_TS_S_1)

/** Alias (User Manual Name) for GTM_DPLL_TS_S_1.
* To use register names with standard convension, please use GTM_DPLL_TS_S_1.
*/
#define	GTM_TS_S_OLD_1	(GTM_DPLL_TS_S_1)

/** \\brief  28400, Actual Signal TRIGGER Time Stamp Register */
#define GTM_DPLL_TS_T_0 /*lint --e(923)*/ (*(volatile Ifx_GTM_TS_T_0*)0xF0128400u)

/** Alias (User Manual Name) for GTM_DPLL_TS_T_0.
* To use register names with standard convension, please use GTM_DPLL_TS_T_0.
*/
#define	GTM_TS_T_OLD_0	(GTM_DPLL_TS_T_0)

/** Alias (User Manual Name) for GTM_DPLL_TS_T_0.
* To use register names with standard convension, please use GTM_DPLL_TS_T_0.
*/
#define	GTM_TS_T_0	(GTM_DPLL_TS_T_0)

/** \\brief  28404, Actual Signal TRIGGER Time Stamp Register */
#define GTM_DPLL_TS_T_1 /*lint --e(923)*/ (*(volatile Ifx_GTM_TS_T_1*)0xF0128404u)

/** Alias (User Manual Name) for GTM_DPLL_TS_T_1.
* To use register names with standard convension, please use GTM_DPLL_TS_T_1.
*/
#define	GTM_TS_T_1	(GTM_DPLL_TS_T_1)

/** Alias (User Manual Name) for GTM_DPLL_TS_T_1.
* To use register names with standard convension, please use GTM_DPLL_TS_T_1.
*/
#define	GTM_TS_T_OLD_1	(GTM_DPLL_TS_T_1)

/** \\brief  28E00, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC0 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E00u)

/** \\brief  28E04, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC1 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E04u)

/** \\brief  28E28, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC10 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E28u)

/** \\brief  28E2C, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC11 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E2Cu)

/** \\brief  28E30, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC12 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E30u)

/** \\brief  28E34, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC13 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E34u)

/** \\brief  28E38, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC14 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E38u)

/** \\brief  28E3C, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC15 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E3Cu)

/** \\brief  28E40, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC16 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E40u)

/** \\brief  28E44, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC17 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E44u)

/** \\brief  28E48, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC18 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E48u)

/** \\brief  28E4C, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC19 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E4Cu)

/** \\brief  28E08, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC2 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E08u)

/** \\brief  28E50, DPLL Calculate Time Stamp Register */
#define GTM_DPLL_TSAC20 /*lint --e(923)*/ (*(volatile Ifx_GTM_DPLL_TSAC*)0xF0128E50u)

